Revit 2027 API
PathReinforcement.PrimaryBarOrientation Property
 Orientation of primary bars of Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReinforcementBarOrientation PrimaryBarOrientation { get; set; }
Public Property PrimaryBarOrientation As ReinforcementBarOrientation
	Get
	Set
public:
property ReinforcementBarOrientation PrimaryBarOrientation {
	ReinforcementBarOrientation get ();
	void set (ReinforcementBarOrientation value);
}
member PrimaryBarOrientation : ReinforcementBarOrientation with get, set
Property Value
ReinforcementBarOrientation
Exceptions
Exception | Condition
ArgumentException |  When setting this property: This orientation is not allowed for primary bars.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The orientation corresponds to the bars' rotation in the Path Reinforcement element. It indicates the postion of the major segment of the primary Rebar Shape relative to the edges of a rectangular region which bounds the Path Reinforcement, where the top/exterior and bottom/interior come from the cover boundaries of the host, the near side edge is defined by the Path Reinforcement sketch line, and the far side edge is derived from bar length (defaulting to 5').
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace